DovPearX/vesc_express/sdkconfig.defaults.esp32c6_fh4
#
# Automatically generated file. DO NOT EDIT.
# Espressif IoT Development Framework (ESP-IDF) 6.0.2 Project Configuration
#
# default:
CONFIG_SOC_ADC_SUPPORTED=y
# default:
CONFIG_SOC_DEDICATED_GPIO_SUPPORTED=y
# default:
CONFIG_SOC_UART_SUPPORTED=y
# default:
CONFIG_SOC_UHCI_SUPPORTED=y
# default:
CONFIG_SOC_GDMA_SUPPORTED=y
# default:
CONFIG_SOC_AHB_GDMA_SUPPORTED=y
# default:
CONFIG_SOC_GPTIMER_SUPPORTED=y
# default:
CONFIG_SOC_PCNT_SUPPORTED=y
# default:
CONFIG_SOC_MCPWM_SUPPORTED=y
# default:
CONFIG_SOC_TWAI_SUPPORTED=y
# default:
CONFIG_SOC_ETM_SUPPORTED=y
# default:
CONFIG_SOC_PARLIO_SUPPORTED=y
# default:
CONFIG_SOC_BT_SUPPORTED=y
# default:
CONFIG_SOC_IEEE802154_SUPPORTED=y
# default:
CONFIG_SOC_ASYNC_MEMCPY_SUPPORTED=y
# default:
CONFIG_SOC_USB_SERIAL_JTAG_SUPPORTED=y
# default:
CONFIG_SOC_TEMP_SENSOR_SUPPORTED=y
# default:
CONFIG_SOC_PHY_SUPPORTED=y
# default:
CONFIG_SOC_WIFI_SUPPORTED=y
# default:
CONFIG_SOC_SUPPORTS_SECURE_DL_MODE=y
# default:
CONFIG_SOC_ULP_SUPPORTED=y
# default:
CONFIG_SOC_LP_CORE_SUPPORTED=y
# default:
CONFIG_SOC_EFUSE_KEY_PURPOSE_FIELD=y
# default:
CONFIG_SOC_EFUSE_SUPPORTED=y
# default:
CONFIG_SOC_RTC_FAST_MEM_SUPPORTED=y
# default:
CONFIG_SOC_RTC_MEM_SUPPORTED=y
# default:
CONFIG_SOC_I2S_SUPPORTED=y
# default:
CONFIG_SOC_RMT_SUPPORTED=y
# default:
CONFIG_SOC_SDM_SUPPORTED=y
# default:
CONFIG_SOC_GPSPI_SUPPORTED=y
# default:
CONFIG_SOC_LEDC_SUPPORTED=y
# default:
CONFIG_SOC_I2C_SUPPORTED=y
# default:
CONFIG_SOC_SYSTIMER_SUPPORTED=y
# default:
CONFIG_SOC_SUPPORT_COEXISTENCE=y
# default:
CONFIG_SOC_AES_SUPPORTED=y
# default:
CONFIG_SOC_MPI_SUPPORTED=y
# default:
CONFIG_SOC_SHA_SUPPORTED=y
# default:
CONFIG_SOC_HMAC_SUPPORTED=y
# default:
CONFIG_SOC_DIG_SIGN_SUPPORTED=y
# default:
CONFIG_SOC_ECC_SUPPORTED=y
# default:
CONFIG_SOC_FLASH_ENC_SUPPORTED=y
# default:
CONFIG_SOC_SECURE_BOOT_SUPPORTED=y
# default:
CONFIG_SOC_SDIO_SLAVE_SUPPORTED=y
# default:
CONFIG_SOC_BOD_SUPPORTED=y
# default:
CONFIG_SOC_APM_SUPPORTED=y
# default:
CONFIG_SOC_PMU_SUPPORTED=y
# default:
CONFIG_SOC_PMU_PVT_SUPPORTED=y
# default:
CONFIG_SOC_PAU_SUPPORTED=y
# default:
CONFIG_SOC_RTC_TIMER_V2_SUPPORTED=y
# default:
CONFIG_SOC_LP_AON_SUPPORTED=y
# default:
CONFIG_SOC_LP_PERIPHERALS_SUPPORTED=y
# default:
CONFIG_SOC_LP_I2C_SUPPORTED=y
# default:
CONFIG_SOC_ULP_LP_UART_SUPPORTED=y
# default:
CONFIG_SOC_CLK_TREE_SUPPORTED=y
# default:
CONFIG_SOC_ASSIST_DEBUG_SUPPORTED=y
# default:
CONFIG_SOC_WDT_SUPPORTED=y
# default:
CONFIG_SOC_SPI_FLASH_SUPPORTED=y
# default:
CONFIG_SOC_RNG_SUPPORTED=y
# default:
CONFIG_SOC_LIGHT_SLEEP_SUPPORTED=y
# default:
CONFIG_SOC_DEEP_SLEEP_SUPPORTED=y
# default:
CONFIG_SOC_MODEM_CLOCK_SUPPORTED=y
# default:
CONFIG_SOC_PM_SUPPORTED=y
# default:
CONFIG_SOC_XTAL_SUPPORT_40M=y
# default:
CONFIG_SOC_XTAL_CLOCK_PATH_DEPENDS_ON_TOP_DOMAIN=y
# default:
CONFIG_SOC_AES_SUPPORT_DMA=y
# default:
CONFIG_SOC_AES_GDMA=y
# default:
CONFIG_SOC_AES_SUPPORT_AES_128=y
# default:
CONFIG_SOC_AES_SUPPORT_AES_256=y
# default:
CONFIG_SOC_ADC_DIG_CTRL_SUPPORTED=y
# default:
CONFIG_SOC_ADC_DIG_IIR_FILTER_SUPPORTED=y
# default:
CONFIG_SOC_ADC_MONITOR_SUPPORTED=y
# default:
CONFIG_SOC_ADC_DMA_SUPPORTED=y
# default:
CONFIG_SOC_ADC_PERIPH_NUM=1
# default:
CONFIG_SOC_ADC_MAX_CHANNEL_NUM=7
# default:
CONFIG_SOC_ADC_ATTEN_NUM=4
# default:
CONFIG_SOC_ADC_DIGI_CONTROLLER_NUM=1
# default:
CONFIG_SOC_ADC_PATT_LEN_MAX=8
# default:
CONFIG_SOC_ADC_DIGI_MAX_BITWIDTH=12
# default:
CONFIG_SOC_ADC_DIGI_MIN_BITWIDTH=12
# default:
CONFIG_SOC_ADC_DIGI_IIR_FILTER_NUM=2
# default:
CONFIG_SOC_ADC_DIGI_MONITOR_NUM=2
# default:
CONFIG_SOC_ADC_DIGI_RESULT_BYTES=4
# default:
CONFIG_SOC_ADC_DIGI_DATA_BYTES_PER_CONV=4
# default:
CONFIG_SOC_ADC_SAMPLE_FREQ_THRES_HIGH=83333
# default:
CONFIG_SOC_ADC_SAMPLE_FREQ_THRES_LOW=611
# default:
CONFIG_SOC_ADC_RTC_MIN_BITWIDTH=12
# default:
CONFIG_SOC_ADC_RTC_MAX_BITWIDTH=12
# default:
CONFIG_SOC_ADC_CALIBRATION_V1_SUPPORTED=y
# default:
CONFIG_SOC_ADC_SELF_HW_CALI_SUPPORTED=y
# default:
CONFIG_SOC_ADC_CALIB_CHAN_COMPENS_SUPPORTED=y
# default:
CONFIG_SOC_ADC_TEMPERATURE_SHARE_INTR=y
# default:
CONFIG_SOC_ADC_SHARED_POWER=y
# default:
CONFIG_SOC_BROWNOUT_RESET_SUPPORTED=y
# default:
CONFIG_SOC_SHARED_IDCACHE_SUPPORTED=y
# default:
CONFIG_SOC_CACHE_FREEZE_SUPPORTED=y
# default:
CONFIG_SOC_CPU_CORES_NUM=1
# default:
CONFIG_SOC_CPU_INTR_NUM=32
# default:
CONFIG_SOC_CPU_HAS_FLEXIBLE_INTC=y
# default:
CONFIG_SOC_INT_PLIC_SUPPORTED=y
# default:
CONFIG_SOC_CPU_HAS_CSR_PC=y
# default:
CONFIG_SOC_CPU_BREAKPOINTS_NUM=4
# default:
CONFIG_SOC_CPU_WATCHPOINTS_NUM=4
# default:
CONFIG_SOC_CPU_WATCHPOINT_MAX_REGION_SIZE=0x80000000
# default:
CONFIG_SOC_CPU_HAS_PMA=y
# default:
CONFIG_SOC_CPU_IDRAM_SPLIT_USING_PMP=y
# default:
CONFIG_SOC_CPU_PMP_REGION_GRANULARITY=4
# default:
CONFIG_SOC_CPU_MISALIGNED_ACCESS_ON_PMP_MISMATCH_ISSUE=y
# default:
CONFIG_SOC_DS_SIGNATURE_MAX_BIT_LEN=3072
# default:
CONFIG_SOC_DS_KEY_PARAM_MD_IV_LENGTH=16
# default:
CONFIG_SOC_DS_KEY_CHECK_MAX_WAIT_US=1100
# default:
CONFIG_SOC_AHB_GDMA_VERSION=1
# default:
CONFIG_SOC_GDMA_SUPPORT_ETM=y
# default:
CONFIG_SOC_GDMA_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_GPIO_PORT=1
# default:
CONFIG_SOC_GPIO_PIN_COUNT=31
# default:
CONFIG_SOC_GPIO_SUPPORT_PIN_GLITCH_FILTER=y
# default:
CONFIG_SOC_GPIO_FLEX_GLITCH_FILTER_NUM=8
# default:
CONFIG_SOC_GPIO_SUPPORT_ETM=y
# default:
CONFIG_SOC_GPIO_SUPPORT_HP_PERIPH_PD_SLEEP_WAKEUP=y
# default:
CONFIG_SOC_LP_IO_CLOCK_IS_INDEPENDENT=y
# default:
CONFIG_SOC_GPIO_IN_RANGE_MAX=30
# default:
CONFIG_SOC_GPIO_OUT_RANGE_MAX=30
# default:
CONFIG_SOC_GPIO_HP_PERIPH_PD_SLEEP_WAKEABLE_MASK=0
# default:
CONFIG_SOC_GPIO_HP_PERIPH_PD_SLEEP_WAKEABLE_PIN_CNT=8
# default:
CONFIG_SOC_GPIO_VALID_DIGITAL_IO_PAD_MASK=0x000000007FFFFF00
# default:
CONFIG_SOC_GPIO_SUPPORT_FORCE_HOLD=y
# default:
CONFIG_SOC_GPIO_SUPPORT_HOLD_SINGLE_IO_IN_DSLP=y
# default:
CONFIG_SOC_GPIO_CLOCKOUT_BY_GPIO_MATRIX=y
# default:
CONFIG_SOC_CLOCKOUT_HAS_SOURCE_GATE=y
# default:
CONFIG_SOC_GPIO_CLOCKOUT_CHANNEL_NUM=3
# default:
CONFIG_SOC_RTCIO_PIN_COUNT=8
# default:
CONFIG_SOC_RTCIO_INPUT_OUTPUT_SUPPORTED=y
# default:
CONFIG_SOC_RTCIO_HOLD_SUPPORTED=y
# default:
CONFIG_SOC_RTCIO_WAKE_SUPPORTED=y
# default:
CONFIG_SOC_SDM_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_ETM_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_I2C_NUM=2
# default:
CONFIG_SOC_HP_I2C_NUM=1
# default:
CONFIG_SOC_LP_I2C_NUM=1
# default:
CONFIG_SOC_I2C_SUPPORT_XTAL=y
# default:
CONFIG_SOC_I2C_SUPPORT_RTC=y
# default:
CONFIG_SOC_I2C_SUPPORT_10BIT_ADDR=y
# default:
CONFIG_SOC_I2C_SUPPORT_SLAVE=y
# default:
CONFIG_SOC_I2C_SLAVE_SUPPORT_BROADCAST=y
# default:
CONFIG_SOC_I2C_SLAVE_CAN_GET_STRETCH_CAUSE=y
# default:
CONFIG_SOC_I2C_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_I2S_HW_VERSION_2=y
# default:
CONFIG_SOC_I2S_SUPPORTS_ETM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PCM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM_TX=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PCM2PDM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM_RX=y
# default:
CONFIG_SOC_I2S_PDM_MAX_TX_LINES=2
# default:
CONFIG_SOC_I2S_PDM_MAX_RX_LINES=1
# default:
CONFIG_SOC_I2S_SUPPORTS_TDM=y
# default:
CONFIG_SOC_LEDC_SUPPORT_PLL_DIV_CLOCK=y
# default:
CONFIG_SOC_LEDC_SUPPORT_XTAL_CLOCK=y
# default:
CONFIG_SOC_LEDC_TIMER_NUM=4
# default:
CONFIG_SOC_LEDC_CHANNEL_NUM=6
# default:
CONFIG_SOC_LEDC_TIMER_BIT_WIDTH=20
# default:
CONFIG_SOC_LEDC_SUPPORT_FADE_STOP=y
# default:
CONFIG_SOC_LEDC_GAMMA_CURVE_FADE_SUPPORTED=y
# default:
CONFIG_SOC_LEDC_GAMMA_CURVE_FADE_RANGE_MAX=16
# default:
CONFIG_SOC_LEDC_FADE_PARAMS_BIT_WIDTH=10
# default:
CONFIG_SOC_LEDC_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_LEDC_SUPPORT_ETM=y
# default:
CONFIG_SOC_MMU_PAGE_SIZE_CONFIGURABLE=y
# default:
CONFIG_SOC_MMU_PAGE_SIZE_8KB_SUPPORTED=y
# default:
CONFIG_SOC_MMU_PERIPH_NUM=1
# default:
CONFIG_SOC_MMU_LINEAR_ADDRESS_REGION_NUM=1
# default:
CONFIG_SOC_MMU_DI_VADDR_SHARED=y
# default:
CONFIG_SOC_MPU_MIN_REGION_SIZE=0x20000000
# default:
CONFIG_SOC_MPU_REGIONS_MAX_NUM=8
# default:
CONFIG_SOC_PCNT_SUPPORT_RUNTIME_THRES_UPDATE=y
# default:
CONFIG_SOC_RMT_MEM_WORDS_PER_CHANNEL=48
# default:
CONFIG_SOC_RMT_SUPPORT_RX_PINGPONG=y
# default:
CONFIG_SOC_RMT_SUPPORT_TX_LOOP_COUNT=y
# default:
CONFIG_SOC_RMT_SUPPORT_TX_LOOP_AUTO_STOP=y
# default:
CONFIG_SOC_RMT_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_MCPWM_SWSYNC_CAN_PROPAGATE=y
# default:
CONFIG_SOC_MCPWM_SUPPORT_ETM=y
# default:
CONFIG_SOC_MCPWM_CAPTURE_CLK_FROM_GROUP=y
# default:
CONFIG_SOC_MCPWM_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_PARLIO_TX_UNIT_MAX_DATA_WIDTH=16
# default:
CONFIG_SOC_PARLIO_RX_UNIT_MAX_DATA_WIDTH=16
# default:
CONFIG_SOC_PARLIO_TX_RX_SHARE_INTERRUPT=y
# default:
CONFIG_SOC_PARLIO_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_MPI_MEM_BLOCKS_NUM=4
# default:
CONFIG_SOC_MPI_OPERATIONS_NUM=3
# default:
CONFIG_SOC_RSA_MAX_BIT_LEN=3072
# default:
CONFIG_SOC_SHA_DMA_MAX_BUFFER_SIZE=3968
# default:
CONFIG_SOC_SHA_SUPPORT_DMA=y
# default:
CONFIG_SOC_SHA_SUPPORT_RESUME=y
# default:
CONFIG_SOC_SHA_GDMA=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA1=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA224=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA256=y
# default:
CONFIG_SOC_SPI_PERIPH_NUM=2
# default:
CONFIG_SOC_SPI_MAX_CS_NUM=6
# default:
CONFIG_SOC_SPI_MAXIMUM_BUFFER_SIZE=64
# default:
CONFIG_SOC_SPI_SUPPORT_DDRCLK=y
# default:
CONFIG_SOC_SPI_SLAVE_SUPPORT_SEG_TRANS=y
# default:
CONFIG_SOC_SPI_SUPPORT_CD_SIG=y
# default:
CONFIG_SOC_SPI_SUPPORT_CONTINUOUS_TRANS=y
# default:
CONFIG_SOC_SPI_SUPPORT_SLAVE_HD_VER2=y
# default:
CONFIG_SOC_SPI_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_SPI_SUPPORT_CLK_XTAL=y
# default:
CONFIG_SOC_SPI_SUPPORT_CLK_PLL_F80M=y
# default:
CONFIG_SOC_SPI_SUPPORT_CLK_RC_FAST=y
# default:
CONFIG_SOC_SPI_SCT_SUPPORTED=y
# default:
CONFIG_SOC_SPI_SCT_REG_NUM=14
# default:
CONFIG_SOC_SPI_SCT_BUFFER_NUM_MAX=y
# default:
CONFIG_SOC_SPI_SCT_CONF_BITLEN_MAX=0x3FFFA
# default:
CONFIG_SOC_MEMSPI_IS_INDEPENDENT=y
# default:
CONFIG_SOC_SPI_MAX_PRE_DIVIDER=16
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_AUTO_WAIT_IDLE=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_AUTO_SUSPEND=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_AUTO_RESUME=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_IDLE_INTR=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_SW_SUSPEND=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_CHECK_SUS=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_WRAP=y
# default:
CONFIG_SOC_MEMSPI_ENCRYPTION_ALIGNMENT=16
# default:
CONFIG_SOC_SYSTIMER_COUNTER_NUM=2
# default:
CONFIG_SOC_SYSTIMER_ALARM_NUM=3
# default:
CONFIG_SOC_SYSTIMER_BIT_WIDTH_LO=32
# default:
CONFIG_SOC_SYSTIMER_BIT_WIDTH_HI=20
# default:
CONFIG_SOC_SYSTIMER_FIXED_DIVIDER=y
# default:
CONFIG_SOC_SYSTIMER_SUPPORT_RC_FAST=y
# default:
CONFIG_SOC_SYSTIMER_INT_LEVEL=y
# default:
CONFIG_SOC_SYSTIMER_ALARM_MISS_COMPENSATE=y
# default:
CONFIG_SOC_SYSTIMER_SUPPORT_ETM=y
# default:
CONFIG_SOC_LP_TIMER_BIT_WIDTH_LO=32
# default:
CONFIG_SOC_LP_TIMER_BIT_WIDTH_HI=16
# default:
CONFIG_SOC_TIMER_SUPPORT_ETM=y
# default:
CONFIG_SOC_TIMER_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_MWDT_SUPPORT_XTAL=y
# default:
CONFIG_SOC_MWDT_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_TWAI_CONTROLLER_NUM=2
# default:
CONFIG_SOC_TWAI_MASK_FILTER_NUM=1
# default:
CONFIG_SOC_TWAI_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_EFUSE_DIS_DOWNLOAD_ICACHE=y
# default:
CONFIG_SOC_EFUSE_DIS_PAD_JTAG=y
# default:
CONFIG_SOC_EFUSE_DIS_USB_JTAG=y
# default:
CONFIG_SOC_EFUSE_DIS_DIRECT_BOOT=y
# default:
CONFIG_SOC_EFUSE_SOFT_DIS_JTAG=y
# default:
CONFIG_SOC_EFUSE_DIS_ICACHE=y
# default:
CONFIG_SOC_EFUSE_BLOCK9_KEY_PURPOSE_QUIRK=y
# default:
CONFIG_SOC_EFUSE_XTS_AES_KEY_128=y
# default:
CONFIG_SOC_SECURE_BOOT_V2_RSA=y
# default:
CONFIG_SOC_SECURE_BOOT_V2_ECC=y
# default:
CONFIG_SOC_EFUSE_SECURE_BOOT_KEY_DIGESTS=3
# default:
CONFIG_SOC_EFUSE_REVOKE_BOOT_KEY_DIGESTS=y
# default:
CONFIG_SOC_SUPPORT_SECURE_BOOT_REVOKE_KEY=y
# default:
CONFIG_SOC_FLASH_ENCRYPTED_XTS_AES_BLOCK_MAX=64
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_128=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_PAGE_CONFIGURABLE=y
# default:
CONFIG_SOC_APM_CTRL_FILTER_SUPPORTED=y
# default:
CONFIG_SOC_APM_LP_APM0_SUPPORTED=y
# default:
CONFIG_SOC_APM_SUPPORT_LP_TEE_CTRL=y
# default:
CONFIG_SOC_CRYPTO_DPA_PROTECTION_SUPPORTED=y
# default:
CONFIG_SOC_UART_NUM=3
# default:
CONFIG_SOC_UART_HP_NUM=2
# default:
CONFIG_SOC_UART_LP_NUM=1
# default:
CONFIG_SOC_UART_FIFO_LEN=128
# default:
CONFIG_SOC_LP_UART_FIFO_LEN=16
# default:
CONFIG_SOC_UART_BITRATE_MAX=5000000
# default:
CONFIG_SOC_UART_SUPPORT_RTC_CLK=y
# default:
CONFIG_SOC_UART_SUPPORT_XTAL_CLK=y
# default:
CONFIG_SOC_UART_SUPPORT_WAKEUP_INT=y
# default:
CONFIG_SOC_UART_HAS_LP_UART=y
# default:
CONFIG_SOC_UART_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_UART_WAKEUP_CHARS_SEQ_MAX_LEN=5
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_ACTIVE_THRESH_MODE=y
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_FIFO_THRESH_MODE=y
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_START_BIT_MODE=y
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_CHAR_SEQ_MODE=y
# default:
CONFIG_SOC_UHCI_NUM=1
# default:
CONFIG_SOC_COEX_HW_PTI=y
# default:
CONFIG_SOC_EXTERNAL_COEX_ADVANCE=y
# default:
CONFIG_SOC_PHY_DIG_REGS_MEM_SIZE=21
# default:
CONFIG_SOC_WIFI_LIGHT_SLEEP_CLK_WIDTH=12
# default:
CONFIG_SOC_RTC_MEM_SUPPORT_SPEED_MODE_SWITCH=y
# default:
CONFIG_SOC_PM_SUPPORT_WIFI_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_BEACON_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_BT_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_EXT1_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_EXT1_WAKEUP_MODE_PER_PIN=y
# default:
CONFIG_SOC_PM_SUPPORT_CPU_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_MODEM_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_XTAL32K_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RC32K_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RC_FAST_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_VDDSDIO_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_TOP_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_HP_AON_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_MAC_BB_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RTC_PERIPH_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_PMU_MODEM_STATE=y
# default:
CONFIG_SOC_PM_SUPPORT_PMU_CLK_ICG=y
# default:
CONFIG_SOC_PM_SUPPORT_DEEPSLEEP_CHECK_STUB_ONLY=y
# default:
CONFIG_SOC_PM_CPU_RETENTION_BY_SW=y
# default:
CONFIG_SOC_PM_MODEM_RETENTION_BY_REGDMA=y
# default:
CONFIG_SOC_PM_RETENTION_HAS_CLOCK_BUG=y
# default:
CONFIG_SOC_PM_MODEM_RF_FLAG_UPDATE_WORKAROUND=y
# default:
CONFIG_SOC_PM_PAU_LINK_NUM=4
# default:
CONFIG_SOC_PM_PAU_REGDMA_LINK_MULTI_ADDR=y
# default:
CONFIG_SOC_PM_PAU_REGDMA_LINK_WIFIMAC=y
# default:
CONFIG_SOC_PM_PAU_REGDMA_UPDATE_CACHE_BEFORE_WAIT_COMPARE=y
# default:
CONFIG_SOC_PM_PMU_MIN_SLP_SLOW_CLK_CYCLE_FIXED=y
# default:
CONFIG_SOC_PM_RETENTION_MODULE_NUM=32
# default:
CONFIG_SOC_CLK_RC_FAST_SUPPORT_CALIBRATION=y
# default:
CONFIG_SOC_MODEM_CLOCK_IS_INDEPENDENT=y
# default:
CONFIG_SOC_CLK_XTAL32K_SUPPORTED=y
# default:
CONFIG_SOC_CLK_OSC_SLOW_SUPPORTED=y
# default:
CONFIG_SOC_CLK_RC32K_SUPPORTED=y
# default:
CONFIG_SOC_CLK_LP_FAST_SUPPORT_XTAL_D2=y
# default:
CONFIG_SOC_RCC_IS_INDEPENDENT=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_SUPPORT_FAST_RC=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_SUPPORT_XTAL=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_INTR_SUPPORT=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_SUPPORT_ETM=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_UNDER_PD_TOP_DOMAIN=y
# default:
CONFIG_SOC_RNG_CLOCK_IS_INDEPENDENT=y
# default:
CONFIG_SOC_WIFI_HW_TSF=y
# default:
CONFIG_SOC_WIFI_FTM_SUPPORT=y
# default:
CONFIG_SOC_WIFI_GCMP_SUPPORT=y
# default:
CONFIG_SOC_WIFI_WAPI_SUPPORT=y
# default:
CONFIG_SOC_WIFI_TXOP_SUPPORT=y
# default:
CONFIG_SOC_WIFI_CSI_SUPPORT=y
# default:
CONFIG_SOC_WIFI_MESH_SUPPORT=y
# default:
CONFIG_SOC_WIFI_HE_SUPPORT=y
# default:
CONFIG_SOC_WIFI_MAC_VERSION_NUM=2
# default:
CONFIG_SOC_BLE_SUPPORTED=y
# default:
CONFIG_SOC_BLE_MESH_SUPPORTED=y
# default:
CONFIG_SOC_ESP_NIMBLE_CONTROLLER=y
# default:
CONFIG_SOC_BLE_50_SUPPORTED=y
# default:
CONFIG_SOC_BLE_DEVICE_PRIVACY_SUPPORTED=y
# default:
CONFIG_SOC_BLE_POWER_CONTROL_SUPPORTED=y
# default:
CONFIG_SOC_BLE_PERIODIC_ADV_ENH_SUPPORTED=y
# default:
CONFIG_SOC_BLUFI_SUPPORTED=y
# default:
CONFIG_SOC_BLE_MULTI_CONN_OPTIMIZATION=y
# default:
CONFIG_SOC_BLE_SUBRATE_SUPPORTED=y
# default:
CONFIG_SOC_BLE_PERIODIC_ADV_WITH_RESPONSE=y
# default:
CONFIG_SOC_BLE_USE_WIFI_PWR_CLK_WORKAROUND=y
# default:
CONFIG_SOC_PHY_COMBO_MODULE=y
# default:
CONFIG_SOC_CAPS_NO_RESET_BY_ANA_BOD=y
# default:
CONFIG_SOC_LP_CORE_SINGLE_INTERRUPT_VECTOR=y
# default:
CONFIG_SOC_LP_CORE_SUPPORT_ETM=y
# default:
CONFIG_SOC_DEBUG_HAVE_OCD_STUB_BINS=y
# default:
CONFIG_IDF_CMAKE=y
# default:
CONFIG_IDF_TOOLCHAIN="gcc"
# default:
CONFIG_IDF_TOOLCHAIN_GCC=y
# default:
CONFIG_IDF_TARGET_ARCH_RISCV=y
# default:
CONFIG_IDF_TARGET_ARCH="riscv"
# default:
CONFIG_IDF_TARGET="esp32c6"
# default:
CONFIG_IDF_INIT_VERSION="6.0.2"
# default:
CONFIG_IDF_TARGET_ESP32C6=y
# default:
CONFIG_IDF_FIRMWARE_CHIP_ID=0x000D

#
# Build type
#
CONFIG_APP_BUILD_TYPE_APP_2NDBOOT=y
# CONFIG_APP_BUILD_TYPE_RAM is not set
# default:
CONFIG_APP_BUILD_GENERATE_BINARIES=y
# default:
CONFIG_APP_BUILD_BOOTLOADER=y
# default:
CONFIG_APP_BUILD_USE_FLASH_SECTIONS=y
# CONFIG_APP_REPRODUCIBLE_BUILD is not set
# CONFIG_APP_NO_BLOBS is not set
# end of Build type

#
# App Update config
#
# end of App Update config

#
# Bootloader config
#

#
# Bootloader manager
#
CONFIG_BOOTLOADER_COMPILE_TIME_DATE=y
CONFIG_BOOTLOADER_PROJECT_VER=1
# end of Bootloader manager

#
# Application Rollback
#
# CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE is not set
# end of Application Rollback

#
# Recovery Bootloader and Rollback
#
# end of Recovery Bootloader and Rollback

# default:
CONFIG_BOOTLOADER_OFFSET_IN_FLASH=0x0
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_DEBUG is not set
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF is not set

