DovPearX/vesc_express/sdkconfig.defaults.esp32c6_fh4
# CONFIG_BLE_LOG_ENABLED is not set

#
# Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
#
# CONFIG_BT_BLE_LOG_SPI_OUT_ENABLED is not set
# end of Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
# end of BT Logs

# CONFIG_BT_LE_USED_MEM_STATISTICS_ENABLED is not set
# end of Common Options

#
# Bluedroid Options
#
CONFIG_BT_BTC_TASK_STACK_SIZE=3072
# default:
CONFIG_BT_BLUEDROID_PINNED_TO_CORE=0
CONFIG_BT_BTU_TASK_STACK_SIZE=2048
CONFIG_BT_BLUEDROID_ESP_COEX_VSC=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
# CONFIG_BT_GATTS_PPCP_CHAR_GAP is not set
# CONFIG_BT_BLE_BLUFI_ENABLE is not set
CONFIG_BT_GATT_MAX_SR_PROFILES=4
CONFIG_BT_GATT_MAX_SR_ATTRIBUTES=20
# CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MANUAL is not set
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_AUTO=y
# default:
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MODE=0
# CONFIG_BT_GATTS_ROBUST_CACHING_ENABLED is not set
# CONFIG_BT_GATTS_DEVICE_NAME_WRITABLE is not set
# CONFIG_BT_GATTS_APPEARANCE_WRITABLE is not set
# CONFIG_BT_GATTS_SECURITY_LEVELS_CHAR is not set
# CONFIG_BT_GATTS_KEY_MATERIAL_CHAR is not set
# CONFIG_BT_GATTC_ENABLE is not set
CONFIG_BT_BLE_SMP_ENABLE=y
# CONFIG_BT_SMP_SLAVE_CON_PARAMS_UPD_ENABLE is not set
# CONFIG_BT_BLE_SMP_ID_RESET_ENABLE is not set
CONFIG_BT_BLE_SMP_BOND_NVS_FLASH=y

#
# Bluedroid debug option
#
# CONFIG_BT_BLUEDROID_MEM_DEBUG is not set
# CONFIG_BT_BLUEDROID_MEM_STATS is not set
# CONFIG_BT_BLUEDROID_THREAD_DEBUG is not set
# end of Bluedroid debug option

CONFIG_BT_STACK_NO_LOG=y
CONFIG_BT_ACL_CONNECTIONS=3
# CONFIG_BT_MULTI_CONNECTION_ENBALE is not set
# CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST is not set
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=y
# default:
CONFIG_BT_SMP_ENABLE=y
CONFIG_BT_SMP_MAX_BONDS=15
# CONFIG_BT_BLE_ACT_SCAN_REP_ADV_SCAN is not set
CONFIG_BT_MAX_DEVICE_NAME_LEN=32
CONFIG_BT_BLE_RPA_TIMEOUT=900
# default:
# CONFIG_BT_BLE_HOST_ALLOW_SUB_SPEC_MIN_CONN_INT is not set
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# CONFIG_BT_BLE_42_DTM_TEST_EN is not set
CONFIG_BT_BLE_42_ADV_EN=y
CONFIG_BT_BLE_42_SCAN_EN=y
CONFIG_BT_BLE_VENDOR_HCI_EN=y
# CONFIG_BT_BLE_HIGH_DUTY_ADV_INTERVAL is not set
# CONFIG_BT_ABORT_WHEN_ALLOCATION_FAILS is not set
# end of Bluedroid Options

#
# Controller Options
#

#
# HCI Config
#
CONFIG_BT_LE_HCI_INTERFACE_USE_RAM=y
# CONFIG_BT_LE_HCI_INTERFACE_USE_UART is not set
# end of HCI Config

# default:
CONFIG_BT_LE_CONTROLLER_NPL_OS_PORTING_SUPPORT=y
# CONFIG_BT_LE_50_FEATURE_SUPPORT is not set

#
# Memory Settings
#
CONFIG_BT_LE_MSYS_1_BLOCK_COUNT=12
CONFIG_BT_LE_MSYS_1_BLOCK_SIZE=256
CONFIG_BT_LE_MSYS_2_BLOCK_COUNT=24
CONFIG_BT_LE_MSYS_2_BLOCK_SIZE=320
CONFIG_BT_LE_MSYS_BUF_FROM_HEAP=y
CONFIG_BT_LE_ACL_BUF_COUNT=10
CONFIG_BT_LE_ACL_BUF_SIZE=517
CONFIG_BT_LE_HCI_EVT_BUF_SIZE=257
CONFIG_BT_LE_HCI_EVT_HI_BUF_COUNT=30
CONFIG_BT_LE_HCI_EVT_LO_BUF_COUNT=8
# end of Memory Settings

CONFIG_BT_LE_CONTROLLER_TASK_STACK_SIZE=4096

#
# Controller debug features
#
# CONFIG_BT_LE_ERROR_SIM_ENABLED is not set
# CONFIG_BT_LE_ASSERT_WHEN_ABNORMAL_DISCONN_ENABLED is not set
# CONFIG_BT_LE_DEBUG_REMAIN_SCENE_ENABLED is not set
# CONFIG_BT_LE_PTR_CHECK_ENABLED is not set
# CONFIG_BT_LE_MEM_CHECK_ENABLED is not set
# end of Controller debug features

CONFIG_BT_LE_LL_RESOLV_LIST_SIZE=4
CONFIG_BT_LE_SECURITY_ENABLE=y
CONFIG_BT_LE_SM_LEGACY=y
CONFIG_BT_LE_SM_SC=y
# CONFIG_BT_LE_SM_SC_DEBUG_KEYS is not set
CONFIG_BT_LE_LL_CFG_FEAT_LE_ENCRYPTION=y
CONFIG_BT_LE_WHITELIST_SIZE=12
CONFIG_BT_LE_LL_DUP_SCAN_LIST_COUNT=20
CONFIG_BT_LE_LL_SCA=60
# CONFIG_BT_LE_LL_PEER_SCA_SET_ENABLE is not set
CONFIG_BT_LE_MAX_CONNECTIONS=3
# CONFIG_BT_LE_COEX_PHY_CODED_TX_RX_TLIM_EN is not set
CONFIG_BT_LE_COEX_PHY_CODED_TX_RX_TLIM_DIS=y
# default:
CONFIG_BT_LE_COEX_PHY_CODED_TX_RX_TLIM_EFF=0
# CONFIG_BT_LE_SLEEP_ENABLE is not set
CONFIG_BT_LE_LP_CLK_SRC_MAIN_XTAL=y
# CONFIG_BT_LE_LP_CLK_SRC_DEFAULT is not set
CONFIG_BT_LE_USE_ESP_TIMER=y
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_SUPP=y
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=100
CONFIG_BT_CTRL_BLE_ADV_REPORT_DISCARD_THRSHOLD=20
CONFIG_BT_LE_SCAN_DUPL=y
CONFIG_BT_LE_SCAN_DUPL_TYPE_DEVICE=y
# CONFIG_BT_LE_SCAN_DUPL_TYPE_DATA is not set
# CONFIG_BT_LE_SCAN_DUPL_TYPE_DATA_DEVICE is not set
# default:
CONFIG_BT_LE_SCAN_DUPL_TYPE=0
CONFIG_BT_LE_SCAN_DUPL_CACHE_REFRESH_PERIOD=0
CONFIG_BT_LE_MSYS_INIT_IN_CONTROLLER=y
# CONFIG_BT_LE_TX_CCA_ENABLED is not set
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N15 is not set
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N12 is not set
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N9 is not set
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N6 is not set
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N3 is not set
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_N0 is not set
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P3 is not set
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P6 is not set
CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P9=y
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P12 is not set
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P15 is not set
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P18 is not set
# CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P20 is not set
# default:
CONFIG_BT_LE_DFT_TX_POWER_LEVEL_DBM_EFF=9
# CONFIG_BT_LE_CTRL_CHECK_CONNECT_IND_ACCESS_ADDRESS is not set
# CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY is not set

#
# BLE disconnects when Instant Passed (0x28) occurs
#
# CONFIG_BT_LE_CTRL_LLCP_CONN_UPDATE is not set
# CONFIG_BT_LE_CTRL_LLCP_CHAN_MAP_UPDATE is not set
# CONFIG_BT_LE_CTRL_LLCP_PHY_UPDATE is not set
# end of BLE disconnects when Instant Passed (0x28) occurs

CONFIG_BT_CTRL_SCAN_BACKOFF_UPPERLIMITMAX=32
# CONFIG_BT_LE_CTRL_CHAN_ASS_EN is not set
CONFIG_BT_LE_CTRL_ADV_DATA_LENGTH_ZERO_AUX=y
CONFIG_BT_LE_RXBUF_OPT_ENABLED=y
CONFIG_BT_LE_CTRL_FAST_CONN_DATA_TX_EN=y

#
# Reserved Memory Config
#
CONFIG_BT_LE_EXT_ADV_RESERVED_MEMORY_COUNT=2
CONFIG_BT_LE_CONN_RESERVED_MEMORY_COUNT=2
# end of Reserved Memory Config

# CONFIG_BT_LE_DTM_ENABLED is not set

#
# Scheduling Priority Level Config
#
CONFIG_BT_LE_ADV_SCHED_PRIO_LOW_LEVEL=y
# CONFIG_BT_LE_ADV_SCHED_PRIO_MID_LEVEL is not set
# CONFIG_BT_LE_ADV_SCHED_PRIO_HIGH_LEVEL is not set
# default:
CONFIG_BT_LE_DFT_ADV_SCHED_PRIO_LEVEL=0
# CONFIG_BT_LE_PERIODIC_ADV_SCHED_PRIO_LOW_LEVEL is not set
CONFIG_BT_LE_PERIODIC_ADV_SCHED_PRIO_MID_LEVEL=y
# CONFIG_BT_LE_PERIODIC_ADV_SCHED_PRIO_HIGH_LEVEL is not set
# default:
CONFIG_BT_LE_DFT_PERIODIC_ADV_SCHED_PRIO_LEVEL=1
# CONFIG_BT_LE_SYNC_SCHED_PRIO_LOW_LEVEL is not set
CONFIG_BT_LE_SYNC_SCHED_PRIO_MID_LEVEL=y
# CONFIG_BT_LE_SYNC_SCHED_PRIO_HIGH_LEVEL is not set
# default:
CONFIG_BT_LE_DFT_SYNC_SCHED_PRIO_LEVEL=1
# end of Scheduling Priority Level Config

